1. first_transform, second_transform - first_transform, after_first_transform
// задача №25 В начальной версии можно подумать, что и первая и вторая трансформация – это результат работы разных функций, в исправленном варианте понятно, что сначала надо сделать первую трансформацию, а потом на основе ее получить вторую.
2. pre_result, post_result – matrix_to_symbol, matrix_to_syring
// задача №23 – сначала преобразование массива к виду «+», «.», а потом преобразование массива в строку.
3. salary_2 – salary_sorted
// задача №5 переменная хранит значения списка зарплата в отсортированном виде
4. string1, string2 – currentElement, nextElement
// задача №21
5. summ – sum_of_two_elements
// задача №6
6. mx – maximum
// задача №12 – максимальный элемент
7. my_1 – string_without_zero
// задача №9 – строка, из которой удалены нули
8. my – string_without_space
// задача №9 - строка, из которой удалены пробелы
9. long – lenghtList
// long – это просто что-то длинное, а lenghtList – это длина списка, что уже обозначает нечто конкретное
10. out – ratingLine 
// Out переводится с английского как «из», что из контекста задачи ни о чем не говорит, «ratingLine» - итоговая строка
11. sum_distance – distance_sum
//задача №2 – суммарная дистанция
12. num – count
//задача №2 – счетчик элементов списка
